app/controllers/sessions_controller.rb

SELECT * FROM "users" WHERE (login = 'ivani' and pass = '123') LIMIT 1
---
  def create
    @user = User.find(:first ,
                       :conditions => ["login = ? and pass = ?",
                                      params[:user][:login].capitalize!, params[:user][:pass]])